feaser/openblt/Target/Source/ARMCM4_STM32G4/flash.c
/************************************************************************************//**
* \file         Source/ARMCM4_STM32G4/flash.c
* \brief        Bootloader flash driver source file.
* \ingroup      Target_ARMCM4_STM32G4
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*   Copyright (c) 2021  by Feaser    http://www.feaser.com    All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* This file is part of OpenBLT. OpenBLT is free software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published by the Free
* Software Foundation, either version 3 of the License, or (at your option) any later
* version.
*
* OpenBLT is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
* without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR
* PURPOSE. See the GNU General Public License for more details.
*
* You have received a copy of the GNU General Public License along with OpenBLT. It
* should be located in ".\Doc\license.html". If not, contact Feaser to obtain a copy.
*
* \endinternal
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "boot.h"                                /* bootloader generic header          */
#include "stm32g4xx.h"                           /* STM32 CPU and HAL header           */



/****************************************************************************************
* Macro definitions
****************************************************************************************/
/** \brief Value for an invalid sector entry index into flashLayout[]. */
#define FLASH_INVALID_SECTOR_IDX        (0xff)
/** \brief Value for an invalid flash address. */
#define FLASH_INVALID_ADDRESS           (0xffffffff)
/** \brief Standard size of a flash block for writing. */
#define FLASH_WRITE_BLOCK_SIZE          (512)
/** \brief Total numbers of sectors in array flashLayout[]. */
#define FLASH_TOTAL_SECTORS             (sizeof(flashLayout)/sizeof(flashLayout[0]))
/** \brief End address of the bootloader programmable flash. */
#define FLASH_END_ADDRESS               (flashLayout[FLASH_TOTAL_SECTORS-1].sector_start + \
                                         flashLayout[FLASH_TOTAL_SECTORS-1].sector_size - 1)
/** \brief Offset into the user program's vector table where the checksum is located. 
 *         For this target it is set to the end of the vector table. Note that the 
 *         value can be overriden in blt_conf.h, because the size of the vector table
 *         could vary. When changing this value, don't forget to update the location
 *         of the checksum in the user program accordingly. Otherwise the checksum
 *         verification will always fail.
 */
#ifndef BOOT_FLASH_VECTOR_TABLE_CS_OFFSET
#define BOOT_FLASH_VECTOR_TABLE_CS_OFFSET    (0x1D8)
#endif


/****************************************************************************************
* Plausibility checks
****************************************************************************************/
#if (BOOT_FLASH_VECTOR_TABLE_CS_OFFSET >= FLASH_WRITE_BLOCK_SIZE)
#error "BOOT_FLASH_VECTOR_TABLE_CS_OFFSET is set too high. It must be located in the first writable block."
#endif

#ifndef BOOT_FLASH_CUSTOM_LAYOUT_ENABLE
#define BOOT_FLASH_CUSTOM_LAYOUT_ENABLE (0u)
#endif


/****************************************************************************************
* Type definitions
****************************************************************************************/
/** \brief Flash sector descriptor type. */
typedef struct
{
  blt_addr   sector_start;                       /**< sector start address             */
  blt_int32u sector_size;                        /**< sector size in bytes             */
} tFlashSector;

/** \brief    Structure type for grouping flash block information.
 *  \details  Programming is done per block of max FLASH_WRITE_BLOCK_SIZE. for this a
 *            flash block manager is implemented in this driver. this flash block manager
 *            depends on this flash block info structure. It holds the base address of
 *            the flash block and the data that should be programmed into the flash
 *            block. The .base_addr must be a multiple of FLASH_WRITE_BLOCK_SIZE.
 */
typedef struct
{
  blt_addr  base_addr;
  blt_int8u data[FLASH_WRITE_BLOCK_SIZE];
} tFlashBlockInfo;


/****************************************************************************************
* Hook functions
****************************************************************************************/
#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
extern blt_bool FlashCryptoDecryptDataHook(blt_addr address, blt_int8u * data, 
                                           blt_int32u size);
#endif


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static blt_bool   FlashInitBlock(tFlashBlockInfo *block, blt_addr address);
static tFlashBlockInfo *FlashSwitchBlock(tFlashBlockInfo *block, blt_addr base_addr);
static blt_bool   FlashAddToBlock(tFlashBlockInfo *block, blt_addr address,
                                  blt_int8u *data, blt_int32u len);
static blt_bool   FlashWriteBlock(tFlashBlockInfo *block);
static blt_bool   FlashEraseSectors(blt_int8u first_sector_idx,
                                    blt_int8u last_sector_idx);
static blt_int8u  FlashGetSectorIdx(blt_addr address);
static blt_int32u FlashGetPageSize(void);
static blt_int32u FlashGetPage(blt_addr address);
static blt_addr FlashGetBankBaseAddr(blt_int32u bank);
static blt_int32u FlashGetBank(blt_addr address);


/****************************************************************************************
* Local constant declarations
****************************************************************************************/
/** \brief   If desired, it is possible to set BOOT_FLASH_CUSTOM_LAYOUT_ENABLE to > 0
 *           in blt_conf.h and then implement your own version of the flashLayout[] table
 *           in a source-file with the name flash_layout.c. This way you customize the
 *           flash memory size reserved for the bootloader, without having to modify
 *           the flashLayout[] table in this file directly. This file will then include
 *           flash_layout.c so there is no need to compile it additionally with your
 *           project.
 */
#if (BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0)
/** \brief     Array wit the layout of the flash memory.
 *  \details   Also controls what part of the flash memory is reserved for the
 *             bootloader. If the bootloader size changes, the reserved sectors for the
 *             bootloader might need adjustment to make sure the bootloader doesn't get
 *             overwritten.
 *  \attention (1) Category 3 flash devices (STM32G47x/48x) have dual banking mode
 *                 support, which is enabled as the factory default setting. In dual
 *                 banking mode, the second bank always starts at 0x08040000. This means
 *                 that for devices with < 512kb flash, there is actually a gap between
 *                 the first and second banks. In this case it is recommended to change
 *                 the DBANK option bit to switch to single banking mode. That way
 *                 both banks form one contiguous block in the memory map, removing the
 *                 gap. When using dual banking mode for those < 512 kb flash devices
 *                 with dual banking support, you need to update the contents of 
 *                 flashLayout[] to incorporate this gap between the banks. The best 
 *                 way to do this is to set BOOT_FLASH_CUSTOM_LAYOUT_ENABLE to 1 in
 *                 "blt_conf.h" and then add the custom table to "flash_layout.c".
 *             (2) The minimum sector size of 4k is used, even though the minimum
 *                 flash erase size is 2k most of the time. However, Category 3 flash
 *                 devices (STM32G47x/48x) configured for single bank mode (DBANK=0),
 *                 the minimum flash erase size changes to 4k. For compatibility with all
 *                 flash devices, the minimum sector size was therefore set to 4k.
 *                 Some sectors span multiple 4k pages in this table. The only reason for
 *                 this is to not make the table unnecessarily long, which would just
 *                 waste flash space.
 */
static const tFlashSector flashLayout[] =
{
  /* { 0x08000000, 0x01000 },              flash sector  0 - reserved for bootloader   */
  /* { 0x08001000, 0x01000 },              flash sector  1 - reserved for bootloader   */
  /* { 0x08002000, 0x01000 },              flash sector  2 - reserved for bootloader   */
  { 0x08003000, 0x01000 },              /* flash sector  3 - 4kb                       */
  { 0x08004000, 0x01000 },              /* flash sector  4 - 4kb                       */
  { 0x08005000, 0x01000 },              /* flash sector  5 - 4kb                       */
  { 0x08006000, 0x01000 },              /* flash sector  6 - 4kb                       */
  { 0x08007000, 0x01000 },              /* flash sector  7 - 4kb                       */
#if (BOOT_NVM_SIZE_KB > 32)
  { 0x08008000, 0x04000 },              /* flash sector  8 - 16kb                      */
  { 0x0800C000, 0x04000 },              /* flash sector  9 - 16kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 64)
  { 0x08010000, 0x4000 },               /* flash sector 10 - 16kb                      */
  { 0x08014000, 0x4000 },               /* flash sector 11 - 16kb                      */
  { 0x08018000, 0x4000 },               /* flash sector 12 - 16kb                      */
  { 0x0801C000, 0x4000 },               /* flash sector 13 - 16kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 128)
  { 0x08020000, 0x4000 },               /* flash sector 14 - 16kb                      */
  { 0x08024000, 0x4000 },               /* flash sector 15 - 16kb                      */
  { 0x08028000, 0x4000 },               /* flash sector 16 - 16kb                      */
  { 0x0802C000, 0x4000 },               /* flash sector 17 - 16kb                      */
  { 0x08030000, 0x4000 },               /* flash sector 18 - 16kb                      */
  { 0x08034000, 0x4000 },               /* flash sector 19 - 16kb                      */
  { 0x08038000, 0x4000 },               /* flash sector 20 - 16kb                      */
  { 0x0803C000, 0x4000 },               /* flash sector 21 - 16kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 256)
  { 0x08040000, 0x4000 },               /* flash sector 22 - 16kb                      */
  { 0x08044000, 0x4000 },               /* flash sector 23 - 16kb                      */
  { 0x08048000, 0x4000 },               /* flash sector 24 - 16kb                      */
  { 0x0804C000, 0x4000 },               /* flash sector 25 - 16kb                      */
  { 0x08050000, 0x4000 },               /* flash sector 26 - 16kb                      */
  { 0x08054000, 0x4000 },               /* flash sector 27 - 16kb                      */
  { 0x08058000, 0x4000 },               /* flash sector 28 - 16kb                      */
  { 0x0805C000, 0x4000 },               /* flash sector 29 - 16kb                      */
  { 0x08060000, 0x4000 },               /* flash sector 30 - 16kb                      */
  { 0x08064000, 0x4000 },               /* flash sector 31 - 16kb                      */
  { 0x08068000, 0x4000 },               /* flash sector 32 - 16kb                      */
  { 0x0806C000, 0x4000 },               /* flash sector 33 - 16kb                      */
  { 0x08070000, 0x4000 },               /* flash sector 34 - 16kb                      */
  { 0x08074000, 0x4000 },               /* flash sector 35 - 16kb                      */
  { 0x08078000, 0x4000 },               /* flash sector 36 - 16kb                      */
  { 0x0807C000, 0x4000 },               /* flash sector 37 - 16kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 512)
#error "BOOT_NVM_SIZE_KB > 512 is currently not supported."
#endif
};
#else
#include "flash_layout.c"
#endif /* BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0 */


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/** \brief   Local variable with information about the flash block that is currently
 *           being operated on.
 *  \details The smallest amount of flash that can be programmed is
 *           FLASH_WRITE_BLOCK_SIZE. A flash block manager is implemented in this driver
 *           and stores info in this variable. Whenever new data should be flashed, it
 *           is first added to a RAM buffer, which is part of this variable. Whenever
 *           the RAM buffer, which has the size of a flash block, is full or  data needs
 *           to be written to a different block, the contents of the RAM buffer are
 *           programmed to flash. The flash block manager requires some software
 *           overhead, yet results is faster flash programming because data is first
 *           harvested, ideally until there is enough to program an entire flash block,
 *           before the flash device is actually operated on.
 */
static tFlashBlockInfo blockInfo;

