feaser/openblt/Target/Source/ARMCM4_STM32G4/flash.c
  /* give the result back to the caller */
  return result;
} /*** end of FlashGetPageSize ***/


/************************************************************************************//**
** \brief     Determines the flash page number that the specified address belongs to.
** \param     address Flash memory address.
** \return    The flash page number that this address belongs to.
**
****************************************************************************************/
static blt_int32u FlashGetPage(blt_addr address)
{
  blt_int32u result;
  blt_addr   bank_base;
  blt_addr   offset_in_bank;
  blt_int32u bank_size = FLASH_BANK_SIZE;
  
  /* flash devices that support dual banking, could be configured for single bank
   * mode using the DBANK option bit. in single bank mode, both banks are treated as 
   * one large one.
   */
#if defined (FLASH_OPTR_DBANK)
  /* is the flash device configured for single bank mode? */
  if ((FLASH->OPTR & FLASH_OPTR_DBANK) == 0U)
  {
    /* update the bank size to be the size of both banks, so the entire flash. */
    bank_size = FLASH_SIZE;
  }
#endif  
  
  /* determine the base address of the bank that this address belongs to. */
  bank_base = FlashGetBankBaseAddr(FlashGetBank(address));
  /* sanity check. */
  ASSERT_RT(address >= bank_base);

  /* calculate the offset in the bank. */
  offset_in_bank = address - bank_base;
  /* sanity check. */
  ASSERT_RT(offset_in_bank <= bank_size);
  
  /* calculate the flash page number that the specified address belongs to. */
  result = offset_in_bank / FlashGetPageSize();

  /* give the result back to the caller */
  return result;
} /*** end of FlashGetPage ***/


/************************************************************************************//**
** \brief     Determines the base address in the memory map of the specified flash bank.
** \param     bank Flash bank. It can be either FLASH_BANK_1 or FLASH_BANK_2.
** \return    The base address of the bank in the memory map.
**
****************************************************************************************/
static blt_addr FlashGetBankBaseAddr(blt_int32u bank)
{
  blt_addr result;
  
  /* initialize the result for the first bank. */
  result = FLASH_BASE;
  
  /* bank can only be bank 2 if the flash device supports dual banking. */
#if defined (FLASH_OPTR_DBANK)
  /* is the flash device configured for dual bank mode (factory default)? */
  if ((FLASH->OPTR & FLASH_OPTR_DBANK) != 0U)
  {
    /* second flash bank? */
    if (bank != FLASH_BANK_1)
    {
      /* in this case the second bank always starts at 0x08040000. note that for < 512kb
       * flash this consequently means that there is a gap between the first and second
       * bank.
       */
      result = FLASH_BASE + 0x40000u;
    }    
  }  
#endif
  
  /* give the result back to the caller */
  return result;
} /*** end of FlashGetBankBaseAddr ***/


/************************************************************************************//**
** \brief     Determines the flash bank number that the specified address belongs to.
** \param     address Flash memory address.
** \return    The flash bank number that this address belongs to. It can be either
**            FLASH_BANK_1 or FLASH_BANK_2.
**
****************************************************************************************/
static blt_int32u FlashGetBank(blt_addr address)
{
  blt_int32u result = FLASH_BANK_1;

  /* address can only be in bank 2 if the flash device supports dual banking and has
   * dual banking mode enabled (DBANK=1).
   */
#if defined (FLASH_OPTR_DBANK)
  /* is the flash device configured for dual bank mode (factory default)? */
  if ((FLASH->OPTR & FLASH_OPTR_DBANK) != 0U)
  {
    /* is this an address in the second bank? note that in dual banking mode, the second
     * bank always starts at 0x08040000. note that for < 512kb flash this consequently
     * means that there is a gap between the first and second bank.
     */
    if (address >= (FLASH_BASE + 0x40000u))
    {
      /* update the result. */
      result = FLASH_BANK_2;
    }
  }
#endif

  /* give the result back to the caller. */
  return result;
} /*** end of FlashGetBank ***/


/*********************************** end of flash.c ************************************/
